[
  {
    "img": "/assets/img/avatar_2.png",  
    "desc": " I have been a loyal customer of PMC's electrical accessories for over a decade, and my experience has been nothing short of exceptional. The durability and rust-proof properties of their products have consistently exceeded my expectations, even in the most demanding environments. Their products not only stand the test of time but also provide the reliability and peace of mind that professionals like myself depend on. I wholeheartedly recommend PMC to anyone seeking top-tier electrical accessories that deliver unmatched performance and longevity.",  
    "title": "Sunil Chauhan",
    "subTitle": "Project Manager",
    "review": "Great Services"
  },
  {
    "img": "/assets/img/avatar_3.png",  
    "desc": " I can confidently say that PMC electrical accessories are second to none. The exceptional durability and rust-resistant properties of their products have been crucial for my projects, especially in harsh environments. PMC's commitment to excellence has solidified their position as a trusted and valued player in the industry. I wholeheartedly endorse PMC for anyone in need of top-tier electrical solutions.",  
    "title": "Rohit Verma",
    "subTitle": "Director",    
    "review": "TitanEdge Builders"
  },
  {
    "img": "/assets/img/avatar_2.png",  
    "desc": "For all my business's electrical accessory needs, I have consistently chosen PMC for every endeavor. For nearly five years, PMC has been my prime choice due to the exceptional quality and durability of their products. Their offerings require minimal maintenance, even in challenging environments, making them the most reliable option available. Choosing PMC not only guarantees top-tier performance but also helps you become your customers' preferred provider, maintaining a dependable relationship with them no matter what.",  
    "title": "Rishabh Shukla",
    "subTitle": "Services Executive",  
    "review": "IronForge Infrastructure"
  },
  {
    "img": "/assets/img/avatar_1.png",  
    "desc": "Not sure what air conditioning system is as best for your home? Our FrostFree Consultation service provides expert",  
    "title": "Robert Fox",
    "subTitle": "Project Manager",
    "review": "Great Services"
  },
  {
    "img": "/assets/img/avatar_3.png",  
    "desc": "Dust and debris can accumulate in your air conditioning system, reducing its efficiency Our Chill Max Cleaning service",  
    "title": "Guy Hawkins",
    "subTitle": "Product support",    
    "review": "Great Services"
  },
  {
    "img": "/assets/img/avatar_2.png",  
    "desc": "Proper calibration of your AC system your ensures even cooling throughout your as  home. Our Breeze Balance",  
    "title": "Jacob Jones",
    "subTitle": "Customer success",  
    "review": "Great Services"
  } 
]